#!/usr/bin python3
# -*- coding: utf-8 -*-
# @Time    : 19-1-24 上午11:11
# @Author  : 林利芳
# @File    : synonym.py
import re

SYNONYM_DICT = {
	"更改": ["更改", '更换'],
	"改为": ["更改成", "改为", "更改为"],
	"可以": ["可以", "能"],
	"下降": ['降低', "下降"],
	"为什么": ["为何", "为啥"],
	"能不能": ["能不能", "行不行", "可不可以"],
	"不能用": ["不能用", "用不了"],
}

SYNONYM_WRONG = {
	"零时额度": "临时额度",
	"花贝": '花呗',
	"花唄": '花呗',
	"花被": '花呗',
	"蚂蚁花贝": '花呗',
	"蚂蚁花唄": '花呗',
	"蚂蚁花被": '花呗',
	"蚂蚁花呗": '花呗',
	"蚂蚁借呗": '借呗',
	"届不了": '借不了',
	"为何": "为什么",
	"为啥": "为什么",
	"下个月": '下月',
	"上个月": '上月',
	"行不行": '能不能',
	"可不可以": '能不能',
	"用不了": "不能用",
	"不让": '不能',
	"不可以": '不能',
	"不行": '不能',
	"老有": '总有',
	"日息": "利息",
	"更改成": "改为",
	"更改为": "改为",
	"更换": "更改",
	"能": "可以",
	"降低": "下降",
	"受到": "收到",
	',': '，',
	'?': '？',
	'!': '！',
	';': '；',
	'***': '0',
}

PATTERN = [
	[re.compile('\*+'), '*'],
	[re.compile('\?'), '？'],
	[re.compile('\.$'), '。'],
	[re.compile('!'), '！'],
	[re.compile(','), '，'],
	[re.compile(';'), '；'],
	[re.compile('\s+'), ''],
	[re.compile('\ufeff'), ''],
]
