#!/usr/bin python3
# -*- coding: utf-8 -*-
# @Time    : 19-1-24 上午11:11
# @Author  : 林利芳
# @File    : synonym.py
import re

SYNONYM_DICT = {
	"怎么": ["怎么", "如何"],
	"怎样": ["怎么", "如何"],
	"如何": ["怎么", "如何"],
	"更改": ["更改", '更换'],
	"更换": ["更改", '更换'],
	"更改成": ["更改成", "改为", "更改为"],
	"更改为": ["更改成", "改为", "更改为"],
	"可以": ["可以", "能"],
	"为什么": ["为什么", "为啥", "为何"],
	"为何": ["为什么", "为啥", "为何"],
	"为啥": ["为什么", "为啥", "为何"],
	"这么久": ['这么久', "这么长"],
	"降低": ['降低', "下降"],
	"下降": ['降低', "下降"],
	"日息": ['日息', "利息"],
	"不能": ['不能', "不可以", "不让"],
	"不让": ['不能', "不可以", "不让"],
	"不可以": ['不能', "不可以", "不让"],
	"能不能": ['能不能', "可不可以", "行不行"],
	"行不行": ['能不能', "可不可以", "行不行"],
	"可不可以": ['能不能', "可不可以", "行不行"],
	"用不了": ['用不了', "不能用"],
	"不能用": ['用不了', "不能用"],
	"下月": ['下月', "下个月"],
	"下个月": ['下月', "下个月"],
	"花呗": ['花呗', "蚂蚁花呗"],
	"蚂蚁花呗": ['花呗', "蚂蚁花呗"],
	"蚂蚁借呗": ['借呗', "蚂蚁借呗"],
	"借呗": ['借呗', "蚂蚁借呗"],
}

SYNONYM_WRONG = {
	"零时额度": "临时额度",
	"花贝": '花呗',
	"花唄": '花呗',
	"花被": '花呗',
	"蚂蚁花贝": '蚂蚁花呗',
	"蚂蚁花唄": '蚂蚁花呗',
	"蚂蚁花被": '蚂蚁花呗',
	',': '，',
	'?': '？',
	'!': '！',
	';': '；',
	'***': '0',
}

PATTERN = [
	[re.compile('\*+'), '*'],
	[re.compile('\?'), '？'],
	[re.compile('\.$'), '。'],
	[re.compile('!'), '！'],
	[re.compile(','), '，'],
	[re.compile(';'), '；'],
	[re.compile('\s+'), ''],
	[re.compile('\ufeff'), ''],
]
